/* inittsk.c                                            */
/********************************************************/
/* object    | 初期タスク                               */
/* abstract  | 初期タスク定義                           */
/* edit his  | 2025/12/21 新規作成                      */
/*           |                                          */
/********************************************************/

/********************************************************/
/* 外部公開定義                                         */
/********************************************************/
#include <trykernel.h>
#include <knldef.h>

/********************************************************/
/* 外部公開定義                                         */
/********************************************************/
void initsk( INT stacd, void *exinf);
u4 tskstk_ini[256 / sizeof(u4)];
ID tskid_ini;

T_CTSK ctsk_ini = 
{
    .tskatr     = TA_HLNG | TA_RNG0 | TA_USERBUF,
    .task       = initsk,
    .itskpri    = 1,
    .stksz      = sizeof(tskstk_ini),
    .bufptr     = tskstk_ini
};

/********************************************************/
/* 外部公開関数定義                                     */
/********************************************************/

/********************************************************/
/* 関数   | void initsk ( INT stacd, void *exinf )      */
/* 説明   | シリアル通信の初期化                        */
/* 引数   | INT stacd, void *exinf                      */
/* 戻り値 | なし                                        */
/********************************************************/
void initsk( INT stacd, void *exinf )
{
    tm_com_init();
    tm_putstring("Start Kernel");

    usermain();
    tk_ext_tsk();
}

/********************************************************/
/* 関数   | int main( void )                            */
/* 説明   | タスク初期化，実行                          */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
int main( void )
{
    tskid_ini = tk_cre_tsk(&ctsk_ini);
    tk_sta_tsk(tskid_ini, 0);

    while(1);
}

/********************************************************/
/* EOF                                                  */
/********************************************************/
