/* syslib.c                                            */
/********************************************************/
/* object    | システムライブラリ                       */
/* abstract  | システムライブラリ定義                   */
/* edit his  | 2025/12/23 テンプレート作成              */
/*           |                                          */
/********************************************************/
/********************************************************/
/* ヘッダーインクルード                                 */
/********************************************************/
#include <rpkernel.h>
#include <knldef.h> 

/********************************************************/
/* 外部公開関数定義                                     */
/********************************************************/

/********************************************************/
/* 関数   | void tm_com_init( void )                    */
/* 説明   | uartの初期化                                */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
void tm_com_init( void )
{
    out_w(UART0_BASE + UARTx_IBRD, 67);
    out_w(UART0_BASE + UARTx_FBRD, 52);
    out_w(UART0_BASE + UARTx_LCR_H, 0x70);
    out_w(UART0_BASE + UARTx_CR, UART_CR_RXE|UART_CR_TXE|UART_CR_EN);
}

/********************************************************/
/* 関数   | UINT tm_putstring( char* str )              */
/* 説明   | デバッグ用UART出力                          */
/* 引数   | char* str                                   */
/* 戻り値 | cnt                                         */
/********************************************************/
UINT tm_putstring( char* str )
{
    UINT cnt = 0;
    while(*str)
    {
        while((in_w(UART0_BASE + UARTx_FR)
             & UART_FR_TXFF) != 0);
        out_w(UART0_BASE + UARTx_DR, *str++);
        cnt++;
    }
    return cnt;
}

/********************************************************/
/* EOF                                                  */
/********************************************************/
