/* systimer.c                                           */
/********************************************************/
/* object    | システムタイマ                           */
/* abstract  | システムタイマ定義                       */
/* edit his  | 2025/12/23 テンプレート作成              */
/*           |                                          */
/********************************************************/
/********************************************************/
/* ヘッダーインクルード                                 */
/********************************************************/
#include <rpkernel.h>
#include <knldef.h>

/********************************************************/
/* 外部公開変数                                         */
/********************************************************/
TCB *wait_queue;

/* システムタイマ割込みハンドラ */
/********************************************************/
/* 外部公開関数定義                                     */
/********************************************************/
/********************************************************/
/* 関数   | void systimer_handler(void)                 */
/* 説明   | システムタイマ割込みハンドラ                */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
void systimer_handler(void)
{
    TCB     *tcb, *next;

    for( tcb = wait_queue; tcb != NULL; tcb = next) {
        next = tcb->next;
        if(tcb->waitim == TMO_FEVR) {
            continue;
        } else if(tcb->waitim > TIMER_PERIOD) {
            tcb->waitim -= TIMER_PERIOD;  // 待ち時間から経過時間を減じる。
        } else {                          // 待ち時間が経過したタスクを実行できる状態に戻す
            tqueue_remove_entry( &wait_queue, tcb);             // タスクをウェイトキューから外す

            if(tcb->waifct == TWFCT_DLY) {
                *tcb->waierr = E_OK;         // tk_dly_tskからの復帰はエラー無し
            } else {
                *tcb->waierr = E_TMOUT;      // タイムアウト・エラー
            }

            tcb->state      = TS_READY;
            tcb->waifct     = TWFCT_NON;
            tqueue_add_entry( &ready_queue[tcb->itskpri], tcb); // タスクをレディキューにつなぐ
        }
    }
    scheduler();        // スケジューラを実行する
}
/********************************************************/
/* EOF                                                  */
/********************************************************/