/* config.h                                             */
/********************************************************/
/* object    | config定義ヘッダー                       */
/* abstract  | コンフィギュレーション定義               */
/* edit his  | 2025/12/17 新規作成                      */
/*           |                                          */
/********************************************************/
#ifndef CONFIG_H
#define CONFIG_H

/********************************************************/
/* 外部公開定義                                         */
/********************************************************/
#define CNF_MAX_TSKID    32 /* 最大タスク数 */
#define CNF_MAX_TSLPRI   16 /* 最大タスク優先度 */

#define CNF_MAX_FLGID    8  /* 最大イベントフラグ数 */
#define CNF_MAXSEMID     8  /* 最大セマフォ数 */


#endif
/********************************************************/
/* EOF                                                  */
/********************************************************/
