/* syslib.h                                             */
/********************************************************/
/* object    | システム共通ライブラリ                   */
/* abstract  | レジスタ Read & Write etc.. function     */
/* edit his  | 2025/12/14 新規作成                      */
/*           |                                          */
/********************************************************/
#ifndef SYSLIB_H
#define SYSLIB_H

/********************************************************/
/* マクロ定義                                           */
/********************************************************/
#define OP_CLR  0x3000  /* ビットクリア時使用           */
#define OP_SET  0x2000  /* ビットセット時使用           */
#define OP_XOR  0x1000  /* ビット排他的論理和時使用     */

/********************************************************/
/* レジスタ処理関数定義                                 */
/********************************************************/

/********************************************************/
/* 関数   | static inline u4 in_w( u4 adr )             */
/* 説明   | 32bitレジスタからの入力                     */
/* 引数   | u4 adr                                      */
/* 戻り値 | adr                                         */
/********************************************************/
static inline u4 in_w( u4 adr )
{
    return *(v_u4*)adr;
}

/********************************************************/
/* 関数   | static inline void out_w( u4 adr, u4 data ) */
/* 説明   | 32bitレジスタへの出力                       */
/* 引数   | u4 adr, u4 data                             */
/* 戻り値 | なし                                        */
/********************************************************/
static inline void out_w( u4 adr, u4 data )
{
    *(v_u4*)adr = data;
}

/********************************************************/
/* 関数   | static inline void set_w( u4 adr, u4 data ) */
/* 説明   | 32bitレジスタへのクリア出力                 */
/* 引数   | u4 adr, u4 data                             */
/* 戻り値 | なし                                        */
/********************************************************/
static inline u4 clr_w( u4 adr, u4 data )
{
    *(v_u4*)(adr + OP_CLR) = data;
}

/********************************************************/
/* 関数   | static inline void set_w( u4 adr, u4 data ) */
/* 説明   | 32bitレジスタへビットセット                 */
/* 引数   | u4 adr, u4 data                             */
/* 戻り値 | なし                                        */
/********************************************************/
static inline u4 set_w( u4 adr, u4 data )
{
    *(v_u4*)(adr + OP_SET) = data;
}

/********************************************************/
/* 関数   | static inline void xset_w( u4 adr, u4 data )*/
/* 説明   | 32bitレジスタへ排他的論理和出力             */
/* 引数   | u4 adr, u4 data                             */
/* 戻り値 | なし                                        */
/********************************************************/
static inline u4 xset_w( u4 adr, u4 data )
{
    *(v_u4*)(adr + OP_XOR) = data;
}

/********************************************************/
/* 関数   | static inline void set_primask( INT pm )    */
/* 説明   | primaskレジスタ制御関数                     */
/* 引数   | INT pm                                      */
/* 戻り値 | なし                                        */
/********************************************************/
static inline void set_primask( INT pm )
{
    __asm__ volatile("msr primask, %0":: "r"(pm));
}

/********************************************************/
/* 関数   | static inline u4 get_primask( void )        */
/* 説明   | primaskレジスタ制御関数                     */
/* 引数   | なし                                        */
/* 戻り値 | pm                                          */
/********************************************************/
static inline u4 get_primask( void )
{
    u4 pm;
    __asm__ volatile("mrs %0, primask": "=r"(pm));
    return pm;
}

/********************************************************/
/* マクロ | DI, EI                                      */
/* 説明   | 割り込み禁止，割り込み許可マクロ            */
/* 引数   | なし                                        */
/* 戻り値 | なし                                        */
/********************************************************/
/* 割り込み禁止マクロ */
#define DI(intsts) (intsts=get_primask(), set_primask(1));

/* 割り込み許可マクロ */
#define EI(intsts) (iset_primask(intsts))



#endif
/********************************************************/
/* EOF                                                  */
/********************************************************/
