/*********************************************************************************/
/* Copyright OGAWA CONST                                                         */
/*********************************************************************************/
/* file : sys_lib.c                                                              */
/* abst : シテムライブラリ                                                       */
/* hist : 2025 / 10 /03                                                          */
/*********************************************************************************/
#include <trykernel.h>
#include <knldef.h>

/* UART0の初期化 */
/*********************************************************************************/
/* 関数   | tm_com_init(void)                                                    */
/* 説明   | UART0の初期化                                                        */
/* 引数   | なし                                                                 */
/* 戻り値 | なし                                                                 */
/* 作成   | 2025 / 10 /03                                                        */
/*********************************************************************************/
void tm_com_init(void)
{
    out_w(UART0_BASE+UARTx_IBRD, 67);                               /* ボーレート設定 */
    out_w(UART0_BASE+UARTx_FBRD, 52);
    out_w(UART0_BASE+UARTx_LCR_H, 0x70);                            /* データ形式設定 */
    out_w(UART0_BASE+UARTx_CR, UART_CR_RXE|UART_CR_TXE|UART_CR_EN); /* 通信イネーブル */
}


/* デバッグ用UART出力 */
/*********************************************************************************/
/* 関数   | tm_putstring(char* str)                                              */
/* 説明   | デバッグ用UART出力                                                   */
/* 引数   | char* str                                                            */
/* 戻り値 | なし                                                                 */
/* 作成   | 2025 / 10 /03                                                        */
/*********************************************************************************/
UINT tm_putstring(char* str)
{
    UINT	cnt = 0;

    while(*str) {
        while((in_w(UART0_BASE+UARTx_FR) & UART_FR_TXFF)!= 0);  /* 送信FIFOの空き待ち */
        out_w(UART0_BASE+UARTx_DR, *str++);                     /* データ送信 */
        cnt++;
    }
    return cnt;
}

/*********************************************************************************/
/* EOF                                                                           */
/*********************************************************************************/